# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\louis\Desktop\psoc_code_base\CS301_Class.cydsn\CS301_Class.cyprj
# Date: Mon, 15 Oct 2018 01:18:15 GMT
#set_units -time ns
create_clock -name {ADC_theACLK(routed)} -period 633.33333333333326 -waveform {0 316.666666666667} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 16.666666666666664 -waveform {0 8.33333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 16.666666666666664 -waveform {0 8.33333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_QENC} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} -nominal_period 83.333333333333314 [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Clock_PWM} -source [get_pins {ClockBlock/clk_sync}] -edges {1 15 29} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_clock -name {Clock_PWM(fixed-function)} -period 233.33333333333331 -waveform {0 16.6666666666667} [get_pins {ClockBlock/dclk_glb_ff_1}]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 39 77} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 131 261} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_generated_clock -name {Clock2} -source [get_pins {ClockBlock/clk_sync}] -edges {1 1201 2401} -nominal_period 19999.999999999996 [list [get_pins {ClockBlock/dclk_glb_4}]]
create_clock -name {Clock2(fixed-function)} -period 19999.999999999996 -waveform {0 16.6666666666667} -nominal_period 19999.999999999996 [get_pins {ClockBlock/dclk_glb_ff_4}]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\louis\Desktop\psoc_code_base\CS301_Class.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\louis\Desktop\psoc_code_base\CS301_Class.cydsn\CS301_Class.cyprj
# Date: Mon, 15 Oct 2018 01:17:42 GMT
